# IsSlotLocked Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleView..::..IsSlotLocked Method
PanelScheduleView Class See Also
---
Check if the circuit slot in this cell is locked.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsSlotLocked(
	int nRow,
	int nCol
)
```

Visual Basic
---
```text
Public Function IsSlotLocked ( _
	nRow As Integer, _
	nCol As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool IsSlotLocked(
	int nRow,
	int nCol
)
```

# ### Parameters
nRow
    Type: System..::..Int32 Row Number
nCol
    Type: System..::..Int32 Column Number
# ### Return Value
True if the circuit slot in this cell is locked, false otherwise False if the circuit slot not found.
# See Also
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace